{
  "caseStudies": [
    {
      "slug": "stroy-partner-yug",
      "title": "СтройПартнер-Юг",
      "tagline": "Сайт компании для доставки строительных материалов с удобным каталогом и SEO-оптимизацией.",
      "card": {
        "title": "Новый канал продаж для СтройПартнер-Юг",
        "subtitle": "Сайт компании с удобным каталогом и SEO-оптимизацией",
        "result": "Рост онлайн-заявок на 20–25% и улучшенная видимость в поиске."
      },
      "description": "Сайт для компании ООО «СтройПартнер-Юг», специализирующейся на поставках строительных материалов, с удобным каталогом и SEO-оптимизацией.",
      "category": "Web Development",
      "projectType": "Website",
      "src": "https://picsum.photos/600/500?random=7",
      "hint": "e-commerce",
      "technologies": ["Next.js", "React", "TypeScript"],
      "client": "ООО «СтройПартнер-Юг»",
      "industry": "Construction Materials",
      "websiteUrl": "https://sp-ug.ru/",
      "challenge": "Клиент, пришедший по рекомендации проекта Karamida, стремился создать современный сайт для своей компании, специализирующейся на поставках строительных материалов. Основные задачи заключались в доработке дизайна и создании функционального, удобного для пользователей сайта, способного эффективно презентовать более 1000 товарных единиц и стимулировать онлайн-заявки.",
      "solution": "Мы доработали дизайн сайта в соответствии с современными стандартами UX/UI, чтобы обеспечить интуитивно понятную навигацию и привлекательный визуальный стиль. \n\nКлючевые достижения:\n- Реализовали каталог с отображением более 1000 товарных единиц, включая полную информацию о каждом продукте.\n- Интегрировали социальные сети для обработки входящих заказов напрямую через сайт.\n- Подключили SEO-оптимизацию для повышения видимости сайта в поисковых системах.\n- Использовали Next.js для высокой производительности и поддержки SEO.",
      "results": "Сайт стал новым каналом продаж строительных материалов, обеспечив значительный рост онлайн-заявок на **20–25%** в первые три месяца после запуска. Упрощённая навигация и возможность быстрого заказа повысили удобство для клиентов. SEO-оптимизация привела к росту органического трафика уже через первый месяц после запуска.",
      "testimonial": {
        "name": "Клиент СтройПартнер-Юг",
        "title": "Представитель компании",
        "quote": "Pandirect создали для нас современный и удобный сайт, который стал новым каналом продаж. Мы довольны ростом заявок и улучшением видимости в поисковых системах. Команда профессионально подошла к задаче и учла все наши пожелания.",
        "avatar": "https://picsum.photos/100/100?random=7",
        "initials": "СП"
      }
    },
    {
      "slug": "karamida-admin",
      "title": "Karamida Admin",
      "tagline": "Внутренняя платформа для управления заказами с новым бэкендом и масштабируемой админ-панелью.",
      "card": {
        "title": "Karamida Admin — управление заказами",
        "subtitle": "Новый бэкенд и админка для масштабирования в регионы",
        "result": "Единая система, гибкие роли, снижение расходов на инфраструктуру."
      },
      "description": "Обновленная админ-панель и бэкенд-сервис для компании Karamida, обеспечивающие управление заказами и масштабирование в новые регионы.",
      "category": "Web Development",
      "projectType": "Admin Platform",
      "src": "https://picsum.photos/600/500?random=8",
      "hint": "admin platform",
      "technologies": ["React", "Node.js", "TypeScript", "Selectel S3"],
      "client": "Karamida",
      "industry": "Logistics",
      "websiteUrl": "#",
      "challenge": "Компания Karamida планировала масштабирование с выходом на новые регионы и подключением партнерских организаций. Основная задача заключалась в обновлении админ-панели и её адаптации для внутренних сотрудников и внешних пользователей. Дополнительной сложностью было отсутствие единого источника знаний, что требовало создания документации с нуля.",
      "solution": "Мы работали параллельно над админ-панелью и бэкендом, создав и пополняя документацию на основе бизнес-логики и комментариев клиента.\n\n**Работа с админ-панелью:**\n- Провели исследование пользовательских сценариев, выявив ключевые боли менеджеров.\n- Изучили планы клиента и предложили обновленную архитектуру интерфейса.\n- Подготовили и согласовали дизайн сложных разделов.\n- Реализовали новую панель поэтапно, перенаправляя пользователей на новые разделы и закрывая старые.\n- Системно обрабатывали обратную связь для улучшения продукта.\n- Постепенно выявляли и устраняли скрытые проблемы.\n\n**Работа с бэкендом:**\n- Разработали новый сервис для замены старого бэкенда.\n- Внедряли его постепенно, сохраняя консистентность данных.\n- Настроили автогенерацию API-документации из кода.\n- Оптимизировали структуру базы данных после полной миграции.\n- Обновили API-запросы для клиентского и водительского приложений.\n- Вынесли хранение медиа на Selectel S3, сократив расходы.\n- Реализовали гибкую систему ролей и прав доступа.\n- Усилили безопасность, устранив уязвимости старой системы.",
      "results": "Пользователи получили современную и удобную админ-панель, учитывающую их реальные сценарии. Время обработки заказов сократилось за счёт улучшенной навигации и интерфейса. Система стала масштабируемой и готовой к выходу на новые рынки. Новый бэкенд повысил стабильность и скорость работы сервисов. Инфраструктурные затраты на хранение медиа снизились благодаря Selectel S3. Документация ускорила обучение новых сотрудников и упростила поддержку проекта. Гибкая система ролей повысила удобство для разных категорий пользователей, а устранение уязвимостей значительно улучшило безопасность.",
      "testimonial": {
        "name": "Клиент Karamida",
        "title": "Представитель компании",
        "quote": "Pandirect помогли нам создать масштабируемую платформу, которая упростила управление заказами и подготовила нас к расширению. Их подход к документации и обратной связи сделал процесс разработки прозрачным и эффективным.",
        "avatar": "https://picsum.photos/100/100?random=8",
        "initials": "KR"
      }
    },
    {
      "slug": "karamida-mobile-app",
      "title": "Karamida Mobile App",
      "tagline": "Мобильное приложение для заказа строительных материалов с современным дизайном и улучшенной производительностью.",
      "card": {
        "title": "Karamida — перезапуск с новым дизайном",
        "subtitle": "Современное мобильное приложение для строительного ритейла",
        "result": "Рост удержания пользователей, удобный интерфейс, готовность к масштабированию."
      },
      "description": "Полностью переработанное мобильное приложение для компании Karamida, предназначенное для заказа строительных материалов с новым дизайном и высокой производительностью.",
      "category": "Mobile Apps",
      "projectType": "Mobile Application",
      "src": "https://picsum.photos/600/500?random=9",
      "hint": "mobile app",
      "technologies": ["Flutter"],
      "client": "Karamida",
      "industry": "Construction Materials",
      "websiteUrl": "https://apps.apple.com/us/app/karamida/id1465747466",
      "challenge": "Клиент поставил задачу осовременить дизайн приложения, добавить новый функционал и значительно снизить стоимость поддержки. Исходное приложение на React Native, не обновлявшееся более пяти лет, содержало множество устаревших и разнотипных решений, что усложняло его поддержку и развитие.",
      "solution": "Мы провели аудит приложения и предложили два сценария: обновление текущего решения на React Native или полная переработка на Flutter. Клиент выбрал разработку на Flutter для создания современного приложения с единым архитектурным стилем. \n\nРаботы велись параллельно по двум потокам:\n- **Продуктовый поток**: сбор и уточнение требований, разработка и согласование дизайна.\n- **Технический поток**: подготовка моделей данных и интеграция с API заказчика.\n\nИспользование фирменного шаблона приложения на Flutter позволило быстро приступить к разработке функционала. После утверждения дизайна мы реализовали экраны, завершив полный цикл разработки за 3 месяца.",
      "results": "Проведен полный ребрендинг: новое приложение, обновленный логотип, новые страницы в сторах и первый запуск в RuStore. Новый дизайн упростил оформление заказов, увеличив удобство на **200%** и значительно сократив количество ошибок пользователей. Стоимость поддержки приложения снизилась в **10 раз**. Производительность выросла в **2 раза** (и в **4 раза** на слабых устройствах), обеспечив готовность к масштабированию.",
      "testimonial": {
        "name": "Клиент Karamida",
        "title": "Представитель компании",
        "quote": "Pandirect перезапустили наше приложение, сделав его современным и удобным. Новый дизайн и производительность превзошли наши ожидания, а снижение затрат на поддержку стало приятным бонусом. Команда работала быстро и профессионально.",
        "avatar": "https://picsum.photos/100/100?random=9",
        "initials": "KR"
      }
    },
    {
      "slug": "yum-eat",
      "title": "Yum-eat",
      "tagline": "Рекомендательная система для ресторанного бизнеса, повышающая эффективность маркетинга и лояльность клиентов.",
      "card": {
        "title": "Рекомендательная система для ресторанов",
        "subtitle": "Алгоритмы персонализации для маркетинга и гостей",
        "result": "Рост среднего чека на 12%, повторные заказы +20%."
      },
      "description": "Рекомендательная система для Yum-eat, анализирующая данные о заказах и предпочтениях гостей для повышения эффективности маркетинговых кампаний и качества обслуживания.",
      "category": "Data Analytics",
      "projectType": "Recommendation System",
      "src": "https://picsum.photos/600/500?random=10",
      "hint": "restaurant analytics",
      "technologies": ["Python", "TensorFlow", "Node.js", "PostgreSQL"],
      "client": "Yum-eat",
      "industry": "Restaurant Business",
      "websiteUrl": "#",
      "challenge": "Клиент поставил задачу разработать рекомендательную систему для ресторанного бизнеса, чтобы повысить эффективность маркетинговых кампаний, улучшить качество обслуживания, увеличить средний чек и укрепить лояльность клиентов. Система должна была легко интегрироваться с существующими POS и CRM ресторанов.",
      "solution": "Мы разработали рекомендательную систему на основе анализа данных о заказах, предпочтениях гостей и маркетинговых кампаниях. \n\nОсновные возможности:\n- Сегментация аудитории по предпочтениям и поведению.\n- Генерация персонализированных рекомендаций и акций.\n- Прогнозирование среднего чека и вероятности повторного визита.\n- Инструменты для запуска и анализа маркетинговых кампаний.\n- Аналитика в реальном времени: популярные блюда, эффективность акций, уровень лояльности клиентов.\n\nСистема была интегрирована с POS и CRM ресторанов, обеспечивая быстрый доступ к данным и их использование для роста продаж и улучшения обслуживания.",
      "results": "Рестораны перешли на персонализированные предложения, что позволило отказаться от массовых рассылок. Средний чек вырос на **12–20%** за счёт персональных рекомендаций. Лояльность клиентов увеличилась благодаря релевантным акциям и бонусам. Время на запуск маркетинговых кампаний сократилось за счёт автоматизации. Система готова к масштабированию для сетевых ресторанов.",
      "testimonial": {
        "name": "Клиент Yum-eat",
        "title": "Представитель компании",
        "quote": "Pandirect создали мощную рекомендательную систему, которая преобразила наш подход к маркетингу. Персонализированные предложения увеличили средний чек и лояльность клиентов, а интеграция с нашими системами прошла гладко.",
        "avatar": "https://picsum.photos/100/100?random=10",
        "initials": "YE"
      }
    },
    {
      "slug": "docclub-gamified-testing",
      "title": "DocClub",
      "tagline": "Веб-приложение для тестирования врачей в игровой форме.",
      "card": {
        "title": "Интерактивное тестирование врачей",
        "subtitle": "DocClub — веб-приложение с карточными играми и симуляторами",
        "result": "Карточная игра, опросник, симулятор; готово к международному запуску."
      },
      "description": "Веб-приложение DocClub для компании HardDays, обеспечивающее интерактивное тестирование врачей через игровые элементы, такие как карточная игра, опросник и симулятор клинических случаев.",
      "category": "Web Development",
      "projectType": "Web Application",
      "src": "https://picsum.photos/600/500?random=11",
      "hint": "medical gamification",
      "technologies": ["Next.js", "React", "TypeScript", "i18n"],
      "client": "HardDays",
      "industry": "Medical",
      "websiteUrl": "https://youarealegend.club/",
      "challenge": "Партнёрская компания HardDays обратилась с задачей предоставить команду для реализации фронтенда веб-приложения DocClub. Основной целью было уложиться в сжатые сроки при полном отсутствии готового фронтенда, обеспечив разработку интерактивной платформы для тестирования врачей.",
      "solution": "Мы выделили специализированную команду фронтенд-разработчиков, которая взяла на себя полный цикл разработки:\n- Оценка объёма работ и составление плана с учётом игровых механик и выбранного стека.\n- Поэтапная сдача функционала для минимизации рисков.\n- Разработка игровых элементов: карточной игры, опросника и симулятора клинических случаев.\n- Внедрение интернационализации (i18n) для поддержки английского, португальского и испанского языков.\n- Обеспечение адаптивного дизайна для мобильных и десктопных устройств.\n\nКоманда работала в тесной интеграции с бэкендом HardDays, синхронизируя релизы и оперативно адаптируясь к изменяющимся требованиям.",
      "results": "Проект был сдан досрочно, за несколько недель до дедлайна, минимизировав риски при динамичных изменениях требований. Приложение успешно запущено в Бразилии и США. Команда Pandirect обеспечила полный цикл фронтенд-разработки, включая игровые механики и подготовку к глобальному рынку, с высоким качеством кода, UX и безопасности данных.",
      "testimonial": {
        "name": "Юлия",
        "title": "Менеджер проекта, HardDays",
        "quote": "Мы обратились в Pandirect, чтобы оперативно усилить команду фронтенд-разработки для веб-версии DocClub. Они быстро подобрали специалистов с нужным опытом, обеспечили мультиязычность, проработали UX и интерактивность. Их работа по качеству кода и коммуникации была на высоте.",
        "avatar": "https://picsum.photos/100/100?random=11",
        "initials": "ЮЛ"
      }
    },
    {
      "slug": "proex-messenger",
      "title": "ProEx",
      "tagline": "Приватный мессенджер для врачей и пациентов, обеспечивающий безопасное общение и консультации.",
      "card": {
        "title": "1000+ пользователей получили ответы",
        "subtitle": "ProEx — мессенджер для врачей и пациентов",
        "result": "Оптимизированный функционал, расширенные возможности чатов, поддержка команд."
      },
      "description": "Мобильное приложение ProEx, разработанное для безопасного общения между врачами и пациентами, с улучшенным функционалом и поддержкой процессов для получения гранта Сколково.",
      "category": "Mobile Apps",
      "projectType": "Mobile Application",
      "src": "https://picsum.photos/600/500?random=12",
      "hint": "medical messenger",
      "technologies": ["Flutter", "Firebase"],
      "client": "Сидоренко Евгений Евгеньевич",
      "industry": "Healthcare",
      "websiteUrl": "https://apps.apple.com/ru/app/proex/id1557618821",
      "challenge": "Клиент обратился с задачей довести мобильное приложение до релиза, устранив технические ошибки, улучшив качество продукта и добавив новый функционал, чтобы подготовить его для подачи заявки на грант Сколково. Необходимо было оптимизировать архитектуру и обеспечить стабильность работы приложения.",
      "solution": "Мы провели аудит существующего решения, выявили ошибки и недочёты в архитектуре, после чего согласовали план доработок:\n- Исправление технических ошибок и оптимизация кода для повышения стабильности.\n- Обновление дизайна для улучшения пользовательского опыта.\n- Внедрение нового функционала для клиник, включая расширенные возможности чатов.\n- Автоматизация процессов финансовой части и верификации новых врачей.\n- Разработка процессов для команды поддержки.\n\nЗа 6 месяцев команда завершила доработки, провела тестирование гипотез и внедрила улучшения на основе обратной связи, обеспечив готовность к публикации в сторах.",
      "results": "Проект получил статус резидента **Сколково**. Более **2000 пользователей** активно взаимодействуют с приложением, а **500 врачей** предоставляют консультации. Внедрены межкомандные процессы для in-house работы и тестирования. Автоматизированы процессы финансовой части и верификации врачей, а также разработаны процессы для команды поддержки, что повысило эффективность работы сервиса.",
      "testimonial": {
        "name": "Евгений Сидоренко",
        "title": "Доктор медицинских наук, руководитель отдела офтальмологии",
        "quote": "Pandirect довели наш проект до релиза, устранив все недочёты и внедрив новый функционал. Их профессионализм и внимание к деталям помогли нам не только выпустить приложение, но и получить статус резидента Сколково.",
        "avatar": "https://picsum.photos/100/100?random=12",
        "initials": "ЕС"
      }
    },
    {
      "slug": "younet-mobile-app",
      "title": "YouNet",
      "tagline": "Мобильное приложение для профессиональных связей и управления сообществами.",
      "card": {
        "title": "Экономия 30% бюджета на MVP",
        "subtitle": "YouNet — мобильное приложение для сообществ",
        "result": "300 часов разработки, в срок и в бюджет, +500 пользователей."
      },
      "description": "MVP мобильного приложения YouNet, разработанного для организации профессиональных связей и управления сообществами, с возможностью масштабирования и дальнейшего развития.",
      "category": "Mobile Apps",
      "projectType": "Mobile Application",
      "src": "https://picsum.photos/600/500?random=13",
      "hint": "social networking",
      "technologies": ["React Native", "Nest.js", "PostgreSQL"],
      "client": "Тагир Исламов",
      "industry": "Social Networking",
      "websiteUrl": "https://apps.apple.com/us/app/younet/id6444685195",
      "challenge": "Клиент поставил задачу быстро и с минимальными затратами разработать MVP мобильного приложения для проверки бизнес-гипотез, сохранив высокое качество, чтобы продукт можно было развивать дальше при подтверждении гипотез.",
      "solution": "Мы разработали MVP, изначально ориентированное на организацию контактов по профессиональным сферам и интересам, которое затем эволюционировало в инструмент для создания мероприятий и управления сообществами. \n\nОсновные шаги:\n- Анализ проекта и выявление рисков.\n- Планирование и приоритизация функционала для сокращения бюджета.\n- Разработка core-функций с возможностью масштабирования.\n- Тестирование и публикация в Google Play и App Store.\n- Проведение нескольких циклов проверки гипотез.\n- Изменение продукта на основе обратной связи.\n- Ребрендинг и запуск связанного проекта Umeets.",
      "results": "В процессе разработки расходы клиента сократились на **30%**. Приложение привлекло более **500 активных пользователей** и продолжает развиваться, привлекая внимание инвесторов. На базе YouNet заказчик запустил отдельный проект — Umeets, расширяя возможности платформы.",
      "testimonial": {
        "name": "Тагир Исламов",
        "title": "Основатель школы кавказских танцев",
        "quote": "Работая с Pandirect над YouNet, я остался доволен их профессионализмом. Команда не только выполнила задачи в срок, но и предлагала идеи, которые улучшили продукт. Общение было комфортным, а их инициативность помогла найти оптимальные решения.",
        "avatar": "https://picsum.photos/100/100?random=13",
        "initials": "ТИ"
      }
    },
    {
      "slug": "zagadaem-ecommerce",
      "title": "Интернет-магазин подарочных услуг",
      "tagline": "Интернет-магазин подарочных услуг с гибкой админ-панелью и масштабируемой архитектурой.",
      "card": {
        "title": "Оптимизация бюджета перед пандемией",
        "subtitle": "Интернет-магазин подарочных услуг",
        "result": "Бюджетная реализация, +15% продаж, новая админ-панель."
      },
      "description": "Интернет-магазин подарочных услуг, разработанный для масштабирования бизнеса с новой админ-панелью и устранением проблем устаревшей системы OpenCart 2.",
      "category": "E-commerce",
      "projectType": "E-commerce Platform",
      "src": "https://picsum.photos/600/500?random=14",
      "hint": "e-commerce",
      "technologies": ["Yii2", "PHP", "jQuery", "MySQL"],
      "client": "Загадки",
      "industry": "Retail",
      "websiteUrl": "http://zagadaem.ru/",
      "challenge": "Клиент планировал расширение бизнеса на новые города и вывод проекта на новый уровень. Основной задачей было создание гибкой админ-панели и устранение проблем текущего решения: уязвимостей OpenCart 2, ограничений базы данных и неудобного интерфейса для пользователей.",
      "solution": "После анализа мы предложили полную миграцию на Yii2 с переработкой архитектуры базы данных и созданием админ-панели, адаптированной под задачи бизнеса. \n\nКлючевые шаги:\n- Разработка универсальной модели данных для поддержки разнородной структуры товаров и большого количества медиа.\n- Переработка архитектуры для обеспечения масштабируемости.\n- Создание индивидуальной админ-панели, оптимизированной под процессы компании.\n- Устранение уязвимостей и оптимизация производительности.\n\nПроект был реализован в сжатые сроки с учетом бюджетных ограничений клиента.",
      "results": "Создан современный и удобный интерфейс, повысивший лояльность клиентов. Индивидуальная админ-панель оптимизировала внутренние процессы компании. Продажи выросли на **15%**. Проект был реализован в сжатые сроки и с оптимальным бюджетом, что стало важным фактором в преддверии пандемии.",
      "testimonial": {
        "name": "Клиент Загадки",
        "title": "Представитель компании",
        "quote": "Pandirect разработали для нас современный интернет-магазин с удобной админ-панелью, который помог увеличить продажи и подготовиться к расширению. Команда уложилась в сжатые сроки и бюджет, что было критично для нас перед пандемией.",
        "avatar": "https://picsum.photos/100/100?random=14",
        "initials": "ЗГ"
      }
    }
  ]
}